{
  "summary": "Software Development Engineer in Test with over 4 years of experience. Currently I'm using Typescript and Python in my day to day work. During QA cenetered job my interest increasingly leaned to a Software Development side. I created this web app in order to apply my newly aquired skills in React/Redux and create a portofolio project. Please feel free to click around and I hope to hear from you soon!",
  "experience": [
    {
      "companyName": "Alteryx",
      "location": "Broomfield, CO",
      "position": "Software Development Engineer in Test",
      "dates": "July 2020 - Present",
      "description": [
        "Regularly develop automated tests with Python, Selenium that are pivotal to detecting new unique breaking issues in company software",
        "Develop setup and configuration framework that prepare environments for automated testing",
        "Provide informative and comprehensive code reviews",
        "Major participant in focus feature tests and successful company wide bug bashes",
        "Maintain an existing automated test suite, reporting and tracking any defects with Rally while also creating system level test cases that follow real workflow processes using TestRail"
      ]
    },
    {
      "companyName": "Glacier",
      "location": "Aurora, CO",
      "position": "QA Automation Engineer",
      "dates": "June 2018 - July 2020",
      "description": [
        "Created internal automation framework for automating different GUI tests with Python, Selenium",
        "Utilized over 5 different types of testing including functional, regression, and usability to effectively test products and determine issues before they were released into the public",
        "Reported over 150 defects with Jira in an Agile environment, using Python and Selenium WebDriver to write over 30 automation tests"
      ]
    },
    {
      "companyName": "FrontH",
      "location": "New York, NY",
      "position": "QA Engineer",
      "dates": "March 2017 - May 2018",
      "description": [
        "Successfully found and reported over 60 critical product defects and contributed to their resolution",
        "Developed different kinds of tests such as smoke and sanity to further contribute and support efforts within test automation framework",
        "Completed manual testing of over 3 web based products, creating efficient test documents that were beneficial to everyone"
      ]
    }
  ],
  "contactInfo": {
    "phone": "+1 (718)-844-3291",
    "email": "alex.burakou@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/aliaksandr-burakou-57b2221a8/"
  }
}
