{
  "summary": "Experienced Software Engineer with a proven track record with Python, Javascript, Typescript, HTML, CSS and more for exceptional customer experience. Skilled in advanced development methodologies, tools, and processes pivotal in implementing complex software applications. Knowledgeable in extensive troubleshooting, code analysis, and implementing responsive cost-effective solutions.",
  "experience": [
    {
      "companyName": "Alteryx",
      "location": "Broomfield, CO",
      "position": "Software Engineer",
      "dates": "July 2020 - November 2023",
      "description": [
        "Engineered and developed full stack applications on a daily basis using Javascript/Typescript",
        "Engineered and developed micro-frontend application",
        "Maintained code documentation using variety of tools (Confluence, Gitlab Wiki, Swagger)",
        "Ensured applications run smoothly in production and address issues in a timely manner",
        "Architected a robust and extensible testing framework for both desktop and web applications, leading to my promotion to Senior SDET",
        "Served as a mentor, guiding a colleague through learning the Python programming language, which led to his promotion to the SDET title",
        "As a Software Engineer, established and optimized GitLab CI pipelines crucial for the preparation, building, and deployment of code to production, achieving runtimes significantly faster than the average across all company projects",
        "Conducted thorough code reviews that spurred valuable architectural dialogues, upheld code quality and readability, and offered collaborative learning opportunities for my colleagues",
        "Led architectural discussions vital to building maintainable, robust, and extensible systems. Designed a performant and scalable task management system that is now an integral component of the reporting web application"
      ]
    },
    {
      "companyName": "Glacier",
      "location": "Aurora, CO",
      "position": "QA Automation Engineer",
      "dates": "June 2018 - July 2020",
      "description": [
        "Created internal automation framework for automating different GUI tests with Python, Selenium",
        "Designed a test automation framework for an internal company tool, leading to a 40% reduction in regression defects",
        "Reported over 150 defects with Jira in an Agile environment, using Python and Selenium WebDriver to write over 30 automated tests"
      ]
    }
  ]
}
