{
  "summary": "I am a Software Development Engineer with over 5 years of experience. I am adept with Typescript and Python, both utilized in my daily work. My past experience was focused on Quality Engineering where I found an interest in Software Development. I created this web app in order to apply my newly acquired skills in React/Redux and create a portfolio to showcase my skills. Please feel free to click around and I hope to hear from you soon!",
  "experience": [
    {
      "companyName": "Alteryx",
      "location": "Broomfield, CO",
      "position": "Sr. Software Development Engineer in Test",
      "dates": "July 2020 - Present",
      "description": [
        "Regularly develop automated tests with Python, Selenium that are pivotal to detecting new unique breaking issues in company software",
        "Develop setup and configuration framework that prepare environments for automated testing",
        "Provide informative and comprehensive code reviews",
        "Major participant in focus feature tests and successful company wide bug bashes",
        "Maintain an existing automated test suite, reporting and tracking any defects with Rally while also creating system level test cases that follow real workflow processes using TestRail"
      ]
    },
    {
      "companyName": "Glacier",
      "location": "Aurora, CO",
      "position": "QA Automation Engineer",
      "dates": "June 2018 - July 2020",
      "description": [
        "Created internal automation framework for automating different GUI tests with Python, Selenium",
        "Utilized over 5 different types of testing including functional, regression, and usability to effectively test products and determine issues before they were released into the public",
        "Reported over 150 defects with Jira in an Agile environment, using Python and Selenium WebDriver to write over 30 automated tests"
      ]
    },
    {
      "companyName": "FrontH",
      "location": "New York, NY",
      "position": "QA Engineer",
      "dates": "March 2017 - May 2018",
      "description": [
        "Successfully found and reported over 60 critical product defects and contributed to their resolution",
        "Developed different kinds of tests such as smoke and sanity to further contribute and support efforts within a test automation framework",
        "Completed manual testing of over 3 web based products, creating efficient test documents that were beneficial to everyone"
      ]
    }
  ],
  "contactInfo": {
    "phone": "+1 (718)-844-3291",
    "email": "alex.burakou@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/aliaksandr-burakou-57b2221a8/"
  },
  "skills": {
    "general": [
      {
        "name": "Quality Assurance",
        "link": false,
        "description": "I started my carrier as a QA engineer in 2017. In a length of my quality oriented career, I wrote a large number of test cases which were able to uncover serious flaws in software under test. I was heavily involved in test planning and manual test execution activities."
      },
      {
        "name": "Leadership",
        "link": false,
        "description": "Played crucial role in test planning as well as organizing test runs. Provided support with sprint planning and creating user stories that outline scope of work that needs to be completed."
      },
      {
        "name": "Software Development Life Cycle",
        "link": false,
        "description": "Participated in every SDLC stage from as a quality specialist. On each stage from planning to deployment I was helping to ensure that software gets to the customers with the least amount of issues."
      },
      {
        "name": "Reporting & Documentation",
        "link": false,
        "description": "Documented test cases as well as found defects with the help of tools like Rally and JIRA. Provided clear and concise documentation for the code written by myself."
      },
      {
        "name": "Application Testing",
        "link": false,
        "description": "During the course of my career I participated in manual testing of a number of desktop applications as well as web apps. I Was heavily involved with creating test cases and automated scripts for GUI and API tests."
      },
      {
        "name": "Time Management",
        "link": false,
        "description": ""
      },
      {
        "name": "Software Development",
        "link": false,
        "description": "I was able to participate in the planning and implementation of several testing frameworks. This website is my personal project where I combed through all the SDLC, and tried to incorporate good software development practices such as planning, TDD, and CI/CD."
      }
    ],
    "technical": [
      {
        "name": "Python",
        "link": false,
        "description": "I worked on several Python projects like GUI framework for web/desktop application testing, API testing framework and more."
      },
      {
        "name": "JavaScript",
        "link": false,
        "description": ""
      },
      {
        "name": "React",
        "link": "/skills/react",
        "description": "This web application is implemented using React library as a front-end development tool."
      },
      {
        "name": "Redux",
        "link": "/skills/redux",
        "description": "This web application uses Redux as primer state management tool."
      },
      {
        "name": "TypeScript",
        "link": false,
        "description": "This web application is written in the TypeScript programming language."
      },
      {
        "name": "HTML",
        "link": false,
        "description": ""
      },
      {
        "name": "CSS",
        "link": false,
        "description": ""
      },
      {
        "name": "XML",
        "link": false,
        "description": ""
      },
      {
        "name": "JSON",
        "link": false,
        "description": ""
      },
      {
        "name": "SQL",
        "link": false,
        "description": ""
      },
      {
        "name": "Selenium WebDriver",
        "link": false,
        "description": "I have experience with writing GUI automation frameworks and tests with the help of the Selenium WebDriver tool."
      },
      {
        "name": "Nerodia",
        "link": false,
        "description": "As part of my test automation work I used a Selenium based framework called Nerodia to facilitate writing GUI interaction code."
      },
      {
        "name": "HTTP",
        "link": false,
        "description": ""
      },
      {
        "name": "SSH",
        "link": false,
        "description": ""
      },
      {
        "name": "TCP/IP",
        "link": false,
        "description": ""
      },
      {
        "name": "FTP",
        "link": false,
        "description": ""
      },
      {
        "name": "Windows OS",
        "link": false,
        "description": ""
      },
      {
        "name": "macOS",
        "link": false,
        "description": ""
      },
      {
        "name": "JIRA",
        "link": false,
        "description": ""
      },
      {
        "name": "Rally",
        "link": false,
        "description": ""
      },
      {
        "name": "TestRail",
        "link": false,
        "description": ""
      },
      {
        "name": "GIT",
        "link": false,
        "description": ""
      },
      {
        "name": "Visual Studio",
        "link": false,
        "description": ""
      },
      {
        "name": "Webpack",
        "link": false,
        "description": ""
      },
      {
        "name": "Node JS",
        "link": "/skills/node-js",
        "description": ""
      },
      {
        "name": "YAML",
        "link": "/skills/yaml",
        "description": ""
      }
    ]
  }
}
